rofiqcp/agv/embedded/stm32f401/src/main.cpp
  // Manual drive is intentionally latched after one tap, but only while the
  // operator stays on the ACTUATOR page. Leaving that page performs a safe
  // software stop so the vehicle cannot keep moving while STOP is hidden.
  if (currentPage == PAGE_ACTUATOR && page != PAGE_ACTUATOR &&
      (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE)) {
    sendDriveStop();
    activeDriveControl = CTRL_NONE;
  }

  currentPage = page;
  // Do not clear touchWasDown here: when navigation was triggered by a finger
  // press, keeping the down-state prevents the same held touch from re-firing.
  drawCurrentPage(true);
  publishPage();
}

static void restartSplash() {
  if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) {
    sendDriveStop();
  }
  currentPage = PAGE_SPLASH;
  splashComplete = false;
  splashProgress = 0;
  splashReadyText = false;
  lastFrameMs = 0;
  activeDriveControl = CTRL_NONE;
  activeSteerControl = CTRL_NONE;
  resetTouchState();
  uiDirty = false;
  lastUiRefreshMs = 0;
  gTelemetry.systemStatus = SYS_INITIALIZING;
  drawSplashScreen();
  splashStartMs = millis();
  publishPage();
}

// ---------------------------------------------------------------------------
// Command output for manual actuator test
// ---------------------------------------------------------------------------
static void sendDriveCommand(const char* direction) {
  char line[48];
  snprintf(line, sizeof(line), "CMD:DRIVE:%s:%u", direction, gTelemetry.manualSpeedPct);
  printBoth(line);
  gTelemetry.state = STATE_RUNNING;
  uiDirty = true;
}

static void sendDriveStop() {
  printBoth("CMD:DRIVE:STOP");
  gTelemetry.state = STATE_STOPPED;
  uiDirty = true;
}

static void sendSteerTarget(float targetDeg) {
  targetDeg = constrain(targetDeg, STEER_MIN_DEG, STEER_MAX_DEG);
  gTelemetry.steeringTargetDeg = targetDeg;
  gTelemetry.steeringErrorDeg = gTelemetry.steeringTargetDeg - gTelemetry.steeringActualDeg;

  char line[48];
  snprintf(line, sizeof(line), "CMD:STEER:%.1f", targetDeg);
  printBoth(line);
  uiDirty = true;
}

static void setManualSpeed(int value) {
  value = constrain(value, MANUAL_SPEED_MIN, MANUAL_SPEED_MAX);
  gTelemetry.manualSpeedPct = (uint8_t)value;
  char line[32];
  snprintf(line, sizeof(line), "CMD:SPEED:%u", gTelemetry.manualSpeedPct);
  printBoth(line);
  uiDirty = true;
}

static void handleWaypointTap(WaypointAction action) {
  if (action == WP_ACTION_NONE) return;
  const uint8_t selected = gTelemetry.selectedWaypoint < HMI_WAYPOINT_COUNT ?
    gTelemetry.selectedWaypoint : 0;

  if (action == WP_PREV || action == WP_NEXT) {
    int next = selected;
    if (action == WP_PREV) next = (next + HMI_WAYPOINT_COUNT - 1) % HMI_WAYPOINT_COUNT;
    else next = (next + 1) % HMI_WAYPOINT_COUNT;
    gTelemetry.selectedWaypoint = static_cast<uint8_t>(next);
    char line[32];
    snprintf(line, sizeof(line), "CMD:WP:SELECT:%u", gTelemetry.selectedWaypoint);
    printBoth(line);
    updateGpsPage(gTelemetry);
    return;
  }

  char line[32];
  if (action == WP_SAVE) {
    if (!waypointSaveEnabled(gTelemetry)) {
      printBoth("ERR:WP_SAVE_GPS_NOT_READY");
      return;
    }
    snprintf(line, sizeof(line), "CMD:WP:SAVE:%u", selected);
    printBoth(line);
  } else if (action == WP_GO) {
    if (!waypointGoEnabled(gTelemetry)) {
      printBoth("ERR:WP_GO_REQUIRES_SAVED_AUTO_READY");
      return;
    }
    snprintf(line, sizeof(line), "CMD:WP:GO:%u", selected);
    printBoth(line);
  } else if (action == WP_STOP) {
    printBoth("CMD:NAV:STOP");
  }
}

// ---------------------------------------------------------------------------
// Touch behavior
// ---------------------------------------------------------------------------
static bool speedAdjustEnabled() {
  return gTelemetry.rosConnected && gTelemetry.systemStatus == SYS_READY && gTelemetry.mode == MODE_MANUAL;
}

static bool controlAllowed(ControlAction action) {
  if (action == CTRL_STOP) return true;
  if (action == CTRL_FORWARD || action == CTRL_REVERSE) return manualDriveEnabled(gTelemetry);
  if (action == CTRL_LEFT || action == CTRL_RIGHT || action == CTRL_CENTER) return manualSteerEnabled(gTelemetry);
  if (action == CTRL_SPEED_MINUS || action == CTRL_SPEED_PLUS) return speedAdjustEnabled();
  return false;
}

static void handleControlTap(ControlAction action) {
  if (action == CTRL_NONE) return;

  if (!controlAllowed(action)) {
    // Do not send movement commands while AUTO/not-ready/faulted.
    printBoth("ERR:MANUAL_CONTROL_LOCKED");
    return;
  }

  switch (action) {
    case CTRL_FORWARD:
      // If reversing, explicitly stop before changing direction.
      if (activeDriveControl == CTRL_REVERSE) sendDriveStop();
      sendDriveCommand("FWD");
      activeDriveControl = CTRL_FORWARD;
      break;

    case CTRL_REVERSE:
      // If moving forward, explicitly stop before changing direction.
      if (activeDriveControl == CTRL_FORWARD) sendDriveStop();
      sendDriveCommand("REV");
      activeDriveControl = CTRL_REVERSE;
      break;

    case CTRL_LEFT:
      // One tap commands a fixed left steering position.
      sendSteerTarget(STEER_LEFT_PRESET_DEG);
      activeSteerControl = CTRL_LEFT;
      break;

    case CTRL_RIGHT:
      // One tap commands a fixed right steering position.
      sendSteerTarget(STEER_RIGHT_PRESET_DEG);
      activeSteerControl = CTRL_RIGHT;
      break;

    case CTRL_CENTER:
      sendSteerTarget(0.0f);
      activeSteerControl = CTRL_CENTER;
      break;

    case CTRL_STOP:
      sendDriveStop();
      activeDriveControl = CTRL_NONE;
      break;

    case CTRL_SPEED_MINUS:
      setManualSpeed((int)gTelemetry.manualSpeedPct - MANUAL_SPEED_STEP);
      // If already driving, immediately re-issue the latched command at the new speed.
      if (activeDriveControl == CTRL_FORWARD) sendDriveCommand("FWD");
      else if (activeDriveControl == CTRL_REVERSE) sendDriveCommand("REV");
      break;

    case CTRL_SPEED_PLUS:
      setManualSpeed((int)gTelemetry.manualSpeedPct + MANUAL_SPEED_STEP);
      if (activeDriveControl == CTRL_FORWARD) sendDriveCommand("FWD");
      else if (activeDriveControl == CTRL_REVERSE) sendDriveCommand("REV");
      break;

    default:
      break;
  }

  if (currentPage == PAGE_ACTUATOR) {
    updateActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
  }
}

