rofiqcp/agv/embedded/stm32f401/src/main.cpp
static void handleTouch() {
  TouchEvent ev = pollTouch(currentPage);
  if (ev.type == TouchEvent::NONE) return;

  // All controls are edge-triggered: one PRESS = one latched command.
  // RELEASE does not cancel/repeat motion commands.
  if (ev.type == TouchEvent::PRESS) {
    if (ev.modeToggle && currentPage == PAGE_HOME) {
      const bool toManual = gTelemetry.mode != MODE_MANUAL;
      gTelemetry.mode = toManual ? MODE_MANUAL : MODE_AUTO;
      if (!toManual) {
        if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) sendDriveStop();
        activeDriveControl = CTRL_NONE;
        activeSteerControl = CTRL_NONE;
      }
      printBoth(toManual ? "CMD:MODE:MANUAL" : "CMD:MODE:AUTO");
      updateHomePage(gTelemetry);
      publishControlState();
      return;
    }
    if (ev.home) {
      showPage(PAGE_HOME);
      return;
    }
    if (ev.navPage != PAGE_SPLASH) {
      showPage(ev.navPage);
      return;
    }
    if (currentPage == PAGE_CAMERA && ev.cameraTab != CAM_NONE) {
      if (ev.cameraTab == currentCameraTab) return;
      currentCameraTab = ev.cameraTab;
      // Change only the tab strip and content card; never blank the full screen.
      drawCameraTabs(currentCameraTab);
      drawCameraContent(gTelemetry, currentCameraTab);
      publishCameraTab();
      return;
    }
    if (currentPage == PAGE_GPS && ev.waypointAction != WP_ACTION_NONE) {
      handleWaypointTap(ev.waypointAction);
      return;
    }
    if (currentPage == PAGE_ACTUATOR && ev.control != CTRL_NONE) {
      handleControlTap(ev.control);
      return;
    }
  }
}

// ---------------------------------------------------------------------------
// Serial telemetry parser
// GUI/ROS2 -> HMI examples:
// SYS:READY, MODE:MANUAL, STATE:STOPPED, SPD:1.2, HEAD:32.0,
// GPS:1, FIX:3, LAT:-7.050123, LON:110.440235, SAT:17, HDOP:0.82,
// IMU:1, CAM:1, PER:1, OBJ:PERSON, DIST:3.24, CONF:92,
// DRV:1, OBS:0, STEER_TARGET:15, STEER_ACTUAL:14.8, RPM:328, ESC:1, ENC:1
// ---------------------------------------------------------------------------
static bool eqIgnoreCase(const char* a, const char* b) {
  while (*a && *b) {
    char ca = *a++;
    char cb = *b++;
    if (ca >= 'a' && ca <= 'z') ca -= 32;
    if (cb >= 'a' && cb <= 'z') cb -= 32;
    if (ca != cb) return false;
  }
  return *a == '\0' && *b == '\0';
}

static bool parseBool(const char* s) {
  return !strcmp(s, "1") || eqIgnoreCase(s, "ON") || eqIgnoreCase(s, "READY") || eqIgnoreCase(s, "TRUE");
}

static void parseSystemStatus(const char* s) {
  if (eqIgnoreCase(s, "OFF")) gTelemetry.systemStatus = SYS_OFF;
  else if (eqIgnoreCase(s, "STARTING")) gTelemetry.systemStatus = SYS_STARTING;
  else if (eqIgnoreCase(s, "INITIALIZING")) gTelemetry.systemStatus = SYS_INITIALIZING;
  else if (eqIgnoreCase(s, "READY") || eqIgnoreCase(s, "VEHICLE READY")) gTelemetry.systemStatus = SYS_READY;
  else if (eqIgnoreCase(s, "NOT READY")) gTelemetry.systemStatus = SYS_NOT_READY;
  else if (eqIgnoreCase(s, "FAULT")) gTelemetry.systemStatus = SYS_FAULT;
}

static void parseVehicleState(const char* s) {
  if (eqIgnoreCase(s, "STANDBY")) gTelemetry.state = STATE_STANDBY;
  else if (eqIgnoreCase(s, "RUNNING")) gTelemetry.state = STATE_RUNNING;
  else if (eqIgnoreCase(s, "STOPPED") || eqIgnoreCase(s, "STOP")) gTelemetry.state = STATE_STOPPED;
  else if (eqIgnoreCase(s, "FAULT")) gTelemetry.state = STATE_FAULT;
}

static void sanitizeTelemetry() {
  if (!isfinite(gTelemetry.speedKmh)) gTelemetry.speedKmh = 0.0f;
  gTelemetry.speedKmh = constrain(gTelemetry.speedKmh, 0.0f, 100.0f);
  if (!isfinite(gTelemetry.headingDeg)) gTelemetry.headingDeg = 0.0f;
  gTelemetry.headingDeg = fmodf(gTelemetry.headingDeg, 360.0f);
  if (gTelemetry.headingDeg < 0.0f) gTelemetry.headingDeg += 360.0f;
  if (!isfinite(gTelemetry.latitude) || gTelemetry.latitude < -90.0 || gTelemetry.latitude > 90.0) gTelemetry.latitude = 0.0;
  if (!isfinite(gTelemetry.longitude) || gTelemetry.longitude < -180.0 || gTelemetry.longitude > 180.0) gTelemetry.longitude = 0.0;
  if (!isfinite(gTelemetry.hdop)) gTelemetry.hdop = 0.0f;
  gTelemetry.hdop = constrain(gTelemetry.hdop, 0.0f, 99.9f);
  if (!isfinite(gTelemetry.cameraFps)) gTelemetry.cameraFps = 0.0f;
  gTelemetry.cameraFps = constrain(gTelemetry.cameraFps, 0.0f, 120.0f);
  if (!isfinite(gTelemetry.objectDistanceM) || gTelemetry.objectDistanceM < 0.0f) gTelemetry.objectDistanceM = 0.0f;
  if (!isfinite(gTelemetry.confidencePct)) gTelemetry.confidencePct = 0.0f;
  gTelemetry.confidencePct = constrain(gTelemetry.confidencePct, 0.0f, 100.0f);
  if (!isfinite(gTelemetry.steeringTargetDeg)) gTelemetry.steeringTargetDeg = 0.0f;
  if (!isfinite(gTelemetry.steeringActualDeg)) gTelemetry.steeringActualDeg = 0.0f;
  if (!isfinite(gTelemetry.steeringErrorDeg)) gTelemetry.steeringErrorDeg = 0.0f;
  if (!isfinite(gTelemetry.motorRpm)) gTelemetry.motorRpm = 0.0f;
}

static void markRosHeartbeat() {
  const uint32_t now = millis();
  if (!gTelemetry.rosConnected) {
    rosHeartbeatStableCount = 1;
    rosHeartbeatStable = false;
    gTelemetry.rosConnected = true;
    uiDirty = true;
    publishLinkState();
  } else {
    const uint32_t gap = (uint32_t)(now - lastRosHeartbeatMs);
    if (gap <= ROS_HEARTBEAT_STABLE_GAP_MS) {
      if (rosHeartbeatStableCount < 255) ++rosHeartbeatStableCount;
      if (rosHeartbeatStableCount >= ROS_HEARTBEAT_STABLE_COUNT) rosHeartbeatStable = true;
    } else {
      // A busy ROS startup may delay timers. Restart the qualification window
      // without falsely declaring the link dead.
      rosHeartbeatStableCount = 1;
      rosHeartbeatStable = false;
    }
  }
  lastRosHeartbeatMs = now;
}

static void forceRosOffline() {
  const bool wasConnected = gTelemetry.rosConnected;
  if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) sendDriveStop();
  activeDriveControl = CTRL_NONE;
  activeSteerControl = CTRL_NONE;
  gTelemetry.rosConnected = false;
  rosHeartbeatStableCount = 0;
  rosHeartbeatStable = false;
  gTelemetry.systemStatus = SYS_NOT_READY;
  gTelemetry.state = STATE_STOPPED;
  gTelemetry.speedKmh = 0.0f;
  gTelemetry.gpsReady = false;
  gTelemetry.gpsFix = GPS_LOST;
  gTelemetry.imuReady = false;
  gTelemetry.cameraReady = false;
  gTelemetry.perceptionReady = false;
  gTelemetry.cameraFps = 0.0f;
  gTelemetry.drivableAreaClear = false;
  gTelemetry.obstacleDetected = false;
  gTelemetry.escReady = false;
  gTelemetry.encoderReady = false;
  gTelemetry.motorRpm = 0.0f;
  if (gTelemetry.navigationStatus == NAV_QUEUED || gTelemetry.navigationStatus == NAV_NAVIGATING)
    gTelemetry.navigationStatus = NAV_FAILED;
  uiDirty = true;
  if (wasConnected) publishLinkState();
}

static void checkRosLinkTimeout() {
  if (!gTelemetry.rosConnected) return;
  const uint32_t timeoutMs = rosHeartbeatStable ? ROS_LINK_TIMEOUT_MS : ROS_LINK_STARTUP_TIMEOUT_MS;
  if ((uint32_t)(millis() - lastRosHeartbeatMs) > timeoutMs) forceRosOffline();
}

static void handleSerialCommand(char* command) {
  while (*command == ' ' || *command == '\t') command++;
  if (!*command) return;
  // ROS intentionally repeats a complete state heartbeat. Snapshot the visible
  // telemetry so an identical heartbeat does not trigger any TFT transaction.
  const VehicleTelemetry telemetryBefore = gTelemetry;

  // Navigation / health commands
  if (!strcmp(command, "GET:STATE")) {
    publishPage();
    publishLinkState();
    publishControlState();
    publishCameraTab();
    return;
  }
  if (!strcmp(command, "PING")) {
    printBoth("ACK:PONG");
    publishPage();
    publishLinkState();
    publishControlState();
    publishCameraTab();
    return;
  }
  if (!strcmp(command, "BOOT:DFU")) {
    // Fail-safe: never leave a latched drive command active during firmware update.
    if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) {
      sendDriveStop();
      activeDriveControl = CTRL_NONE;
    }
    printBoth("ACK:DFU");
    delay(80);
    enterSystemDfu();
    return;
  }
  if (!strcmp(command, "GOTO:HOME")) { showPage(PAGE_HOME); return; }
  if (!strcmp(command, "GOTO:CAMERA")) { showPage(PAGE_CAMERA); return; }
  if (!strcmp(command, "GOTO:GPS")) { showPage(PAGE_GPS); return; }
  if (!strcmp(command, "GOTO:ACTUATOR")) { showPage(PAGE_ACTUATOR); return; }
  if (!strcmp(command, "GOTO:SPLASH")) { restartSplash(); return; }

