rofiqcp/agv/embedded/stm32f401/src/main.cpp
static bool updateProgressBar() {
  if (splashComplete) return false;

  uint32_t now = millis();
  if (now - lastFrameMs < FRAME_MS) return true;
  lastFrameMs = now;

  uint32_t elapsed = now - splashStartMs;
  if (elapsed < PROGRESS_MS) {
    uint8_t target = (uint8_t)((elapsed * 100UL) / PROGRESS_MS);
    if (target != splashProgress) {
      splashProgress = target;
      int innerW = PB_W - 4;
      int fillW = (int)((splashProgress * innerW) / 100);
      tft.fillRoundRect(PB_X + 2, PB_Y + 2, innerW, PB_H - 4, PB_R - 2, C_BG);
      if (fillW > 0) tft.fillRoundRect(PB_X + 2, PB_Y + 2, fillW, PB_H - 4, PB_R - 2, C_ACCENT);
    }
    return true;
  }

  if (!splashReadyText) {
    splashReadyText = true;
    splashReadyMs = now;
    tft.fillRoundRect(PB_X + 2, PB_Y + 2, PB_W - 4, PB_H - 4, PB_R - 2, C_READY);
    tft.fillRect(70, 186, 180, 18, C_BG);
    drawUiText("HMI ready", W / 2, 187, C_READY, C_BG, MC_DATUM);
  }

  if (splashReadyText && now - splashReadyMs >= READY_HOLD) {
    splashComplete = true;
    beginTouch();
    if (gTelemetry.systemStatus == SYS_INITIALIZING) gTelemetry.systemStatus = SYS_NOT_READY;
    showPage(PAGE_HOME);
    return false;
  }
  return true;
}

#if HMI_DEMO_MODE
static void updateDemoTelemetry() {
  static uint32_t demoMs = 0;
  if (millis() - demoMs < 700) return;
  demoMs = millis();

  gTelemetry.systemStatus = SYS_READY;
  gTelemetry.mode = MODE_MANUAL;
  gTelemetry.state = STATE_STOPPED;
  gTelemetry.gpsReady = true;
  gTelemetry.gpsFix = GPS_3D_FIX;
  gTelemetry.latitude = -7.050123;
  gTelemetry.longitude = 110.440235;
  gTelemetry.satellites = 17;
  gTelemetry.hdop = 0.82f;
  gTelemetry.imuReady = true;
  gTelemetry.cameraReady = true;
  gTelemetry.perceptionReady = true;
  gTelemetry.cameraFps = 8.0f;
  snprintf(gTelemetry.detectedObject, sizeof(gTelemetry.detectedObject), "%s", "PERSON");
  gTelemetry.objectDistanceM = 3.24f;
  gTelemetry.drivableAreaClear = true;
  gTelemetry.obstacleDetected = false;
  gTelemetry.escReady = true;
  gTelemetry.encoderReady = true;
  gTelemetry.speedKmh = 0.0f;
  gTelemetry.headingDeg += 1.0f;
  if (gTelemetry.headingDeg >= 360.0f) gTelemetry.headingDeg = 0.0f;
  gTelemetry.steeringActualDeg = gTelemetry.steeringTargetDeg - 0.2f;
  gTelemetry.steeringErrorDeg = gTelemetry.steeringTargetDeg - gTelemetry.steeringActualDeg;
  gTelemetry.motorRpm = 328.0f;
  uiDirty = true;
}
#endif

void setup() {
  pinMode(PC13, OUTPUT);
  digitalWrite(PC13, HIGH);

  Serial.begin(115200);
#if HMI_LEGACY_UART
  Serial1.begin(115200);
#endif
  delay(50);
  Serial.println(F("ADV HMI visual precise TAP control — boot"));

  initDisplay();
  restartSplash();
}

void loop() {
  // Serial stays full-rate in RAM. ROS link health is independent of USB presence:
  // if the bridge stops sending heartbeats, stale READY states fail closed.
  pollSerialGui();
  checkRosLinkTimeout();

  if (!splashComplete) {
    updateProgressBar();
  } else {
    const uint32_t now = millis();
    if ((uint32_t)(now - lastTouchPollMs) >= TOUCH_POLL_MS) {
      lastTouchPollMs = now;
      handleTouch();
    }

#if HMI_DEMO_MODE
    updateDemoTelemetry();
#endif

    // Full-rate telemetry never means full-rate painting. Each page also caches
    // its formatted values, so only changed pixels are touched at this cadence.
    if (uiDirty && !touchWasDown && (uint32_t)(now - lastUiRefreshMs) >= DISPLAY_REFRESH_MS) {
      lastUiRefreshMs = now;
      uiDirty = false;
      drawCurrentPage(false);
    }
  }

  // Heartbeat LED (PC13 active-low on many Black Pill boards)
  static uint32_t ledMs = 0;
  if (millis() - ledMs >= 500) {
    ledMs = millis();
    digitalWrite(PC13, !digitalRead(PC13));
  }
}
